app/Controllers/Operaciones_creditos.php

    public function mostrar_form_creditos(){

        $model = new Cuenta();
        $datos['cuentas'] = $model->orderBy('id','ASC')->findAll();
---
SELECT *
FROM `cuentas`
ORDER BY `id` ASC

    public function guardar_credito_endb(){

        $request = \Config\Services::request();

        $cuenta = $this->request->getVar('cuenta');
        $num_creditos = $this->request->getVar('numero_creditos');
        $mont_creditos = $this->request->getVar('monto_creditos');
        $mont_capital = $this->request->getVar('monto_capital');
        $mont_iva = $this->request->getVar('monto_iva');

            $data = [

                'id_cuenta'=> $cuenta,
                'numero_de_creditos'=> $num_creditos,
                'monto_credito'=> $mont_creditos,
                'monto_capital'=> $mont_capital,
                'monto_iva'=> $mont_iva
                ];

                $model = new Credito();
                $model->insert($data);
---
INSERT INTO `creditos` (`id_cuenta`, `numero_de_creditos`, `monto_credito`, `monto_capital`, `monto_iva`) VALUES ('16', '1000', '1000', '1000', '1000')