app/Controllers/Operaciones.php

    public function mostrar_datos_cuentas(){

        $model = new Operacion();
        $datos['clientes'] = $model->orderBy('id','ASC')->findAll();
---
SELECT *
FROM `alta_cliente`
ORDER BY `id` ASC