app/Controllers/Operaciones_cuentas.php

SELECT *
FROM `alta_cliente`
ORDER BY `id` ASC
---
    public function add_cuenta(){

        $model = new Operacion();
        $datos['clientes'] = $model->orderBy('id','ASC')->findAll();

INSERT INTO `cuentas` (`id_cliente`, `numero_cuenta`, `tipo_cuenta`) VALUES ('12', 'CCAA7412912411-A', 'pagare')
---
    public function guardar_cuenta_en_db(){


        $request = \Config\Services::request();

        $client = $this->request->getVar('client');
        $num_cuenta = $this->request->getVar('numero_cuenta');
        $tipo_cuenta = $this->request->getVar('tipo_cuenta');

            $data = [

                'id_cliente'=> $client,
                'numero_cuenta'=> $num_cuenta,
                'tipo_cuenta'=> $tipo_cuenta,

                ];

                $model = new Cuenta();
                $model->insert($data);